#+LAYOUT: page
#+TAGS: syllabus 2800 grades policies 
#+PERMALINK: /syllabus/

* Syllabus 

CS 2800 will introduce you to formal logic and its deep connections to
computing. We will study logic from a computational perspective using
the [[javascript:void(0)][ACL2 Sedan theorem proving system]]. The goal
of the course is to introduce fundamental, foundational methods for
modeling, designing and reasoning about computation. This course
considers approaches to proving programs' termination, correctness,
and safety. The course also introduces students to modeling with logic
the range of artifacts and phenomena that arise in computer and
information science.

After this course you will know how to:

  1. translate statements about programs' behavior into logical claims
  2. prove such claims both by hand and using automated tools.

After this course you will appreciate the benefits thinking logically
when developing software, as well as the benefit of formal tools for
ensuring software correctness. You will also familiarize yourself with
the notations for: 

  - propositional and first order predicate logic
  - logical inference
  - mathematical and structural induction
  - recursion 

* CS 2800 website says

This course provides 

* an introduction to formal logic and its deep connections to computing. 



including

- propositional logic, 
- recursion, 
- induction, 
- equational reasoning,
- termination analysis, 
- rewriting, and 
- various proof techniques. 

** We show how to use logic to formalize the syntax and semantics of the core ACL2s language, a simple LISP-based language with contracts. 

** We then use the ACL2s language 

- to formally reason about programs, 

- to model systems at various levels of abstraction, 

- to design and specify interfaces between systems and 

- to reason about such composed systems. 

** We also examine decision procedures for fragments of first-order logic 

** and how such decision procedures can be used to analyze models of systems.

** No required background of any type theory, typed PL, etc. 

We are together in unprecedented times. The typical course structure
implicitly assumes regular whole-class in-person meetings. We will not
have that this semester. No student will be physically present in
class on all days. Some students may not be physically present in
class at all, or on campus period. This change affects much of the
course infrastructure. As such, I *want* you all's feedback and
input. I am open to suggestions and changes; I consider this
preliminary until the end of the first week of class. You can see any
and all changes on the course website's repository.

As a course and a student body, we are more remote than usual, and
preferable. We will leverage a number of Northeastern's technology
platforms to help bridge the chasm.


** Grade Breakdown

   I will assign overall course grades as follows:

      | Category            | Weight (%) |
      |---------------------+------------|
      | Participation       |         10 |
      | Homework*           |         20 |
      | Quizzes             |         10 |
      | Attendance (Lab)    |         20 |
      | Final Project       |         20 |
      | Project Proposal    |         10 |
      | Warm-up Assignments |         10 |
      | Total               |        100 |
      #+TBLFM: @>$2=vsum(@2..@-1)

** Academic Integrity Policy



** Technology and Platforms

As a course and a student body, we are more remote than usual, and
preferable. To help bridge the chasm, I will leverage some of the
technology platforms Northeastern makes available to us.

*** Piazza

[[http://piazza.com/][Piazza]] is our main Q&A forum. We are everyone
learning; no one knows all the answers, and remember that everyone
wears their best and most knowledgeable face. For questions related to
the course material, assignments, policies, or what have you, please
utilize Piazza. If it doesn't "give away the punchline" of some
homework question or assignment, I prefer you ask your question as an
anonymous Piazza post rather than email---this way others get the
benefit of your thoughtful question and answers and corrections scale
to the size of our class.

*** KCCS/CCIS/CCS Github 

I will be utilizing the school's Enterprise git at
[[http://ccs.github.neu.edu]]. You should have access to that with your KCCS
account. I will expect you to know how to access this, for your own
benefits and for coursework.

*** Hypothes.is 

I will expect that students be able to collaboratively edit and
annotate documents. As you read complete the reading assignments, you
will often find areas that are less clear than others, or
sub-optimally ordered, or deficient in a variety of other ways.


*** Course Homepage

I constructed our course homepage as a Jekyll site built with
[[http://orgmode.org][org-mode]]. You will find the ~elisp~ language remarkably similar to the
Common LISP language undergirding ~ACL2~. Student corrections and
improvements are /incredibly/ welcome! You can submit a [[http://github.ccs.neu.edu/jhemann/20FA-2800][Pull Request]]
for a quick correction and improvement. Every page on this website has
a direct links to its ~.org~ file in this repository.
      
*** Handin Server

We will use the [[http://handins.ccs.neu.edu/][Handin server]] (bottlenose) to submit homework. You
will likely have experience with this platform from Fundies I; if you
do not, please read the [[http://ccs.neu.edu/home/blerner/handin-server/handin-server-guide.html][Handin Server Guide]].

*** PollEverywhere

As a part of a participation grade, I will be asking poll questions in
class (often several per class). These will constitute a part of your
grade. I will expect you to login to answer, during the class period
itself. You should ensure that you have this account active and
enabled.

*** Zoom 

I intend to broadcast our course meetings across NEU's Zoom account
platform. I prefer it over MS Teams for a variety of reasons. Not the
least of which is the instantaneous and anonymous feedback that it
provides, via [[http://dialsmith.com/blog/dial-tests-vs-focus-groups-how-are-they-different/][Dial testing]]. 

*** NEU VPN 

Go to [[http://vpn.northeastern.edu]], and follow the instructions to install the
GlobalProctect VPN client on your machine. You will need this to use
the VDI linux machines. If you have difficulty please consult the
[[http://northeastern.service-now.com/tech?id=kb_category&kb_category=07d42f714f02cf0099c2fd511310c7b2][relevant ITS KB articles]], and if necessary [[http://its.northeastern.edu/support/#et-boc:~:text=Still%20Need%20Support%3F][reach out to ITS support]].


*** VDI Linux Machines 

[[http://khoury.northeastern.edu/systems/vdi/][Khoury VDI Virtual Desktops]], and the [[http://northeastern.service-now.com/tech?id=kb_category&kb_category=6b863d8d4f3b5b4450a5798e0210c735&kb_id=d82ad28c134922401528f5104244b068][relevant ITS KB articles]].

*** Eclipse 

*** ACL2 

*** CodeTogether 

We will expect you to be able to share your screen with us via the
CodeTogether platform. If you have difficulty you can get the best
help from [[https://gitter.im/CodeTogether-com/community][CodeTogether
chat]]

*** CodeTogether Voice Extensions. 

* 

